########################### TAPS ###########################

tap "koekeishiya/formulae"
tap "felixkratz/formulae"
tap "sst/tap"
tap "sadiksaifi/mac-menu", "https://github.com/sadiksaifi/mac-menu"

########################### FONTS ###########################

cask "font-fira-code-nerd-font"
cask "font-sf-pro"
cask "sf-symbols"

########################### TERMINAL ###########################

# Terminal App
cask "ghostty"
cask "wezterm@nightly"
cask "vimr"

# Vim
brew "vim"
brew "neovim"
brew "tree-sitter-cli"

# Terminal Workflow
brew "atuin"
brew "bat"
brew "bat-extras"
brew "buku"
brew "carapace"
brew "eza"
brew "fd"
brew "fzf"
brew "git-delta"
brew "git-lfs"
brew "oh-my-posh"
brew "ripgrep"
brew "scmpuff"
brew "stow"
brew "tealdeer"
brew "trash-cli"
brew "zoxide"

# TUI
brew "tmux"
brew "lazygit"
brew "lazydocker"

# CLI
brew "aria2"
brew "bottom"
brew "fastfetch"
brew "ffmpeg"
brew "htop"
brew "imagemagick"
brew "jwt-cli"
brew "mise"
brew "wget"
brew "uv"
brew "xh"
brew "yazi"


########################### DESKTOP ###########################

# Desktop Workflow
brew "yabai"
brew "skhd"
brew "borders"
brew "sketchybar"
brew "mac-menu"

# Desktop App
cask "ente-auth"
cask "firefox"
cask "iina"
cask "localsend"
cask "slack"
cask "tailscale-app"
cask "zoom"

########################### DEVELOPMENT ###########################

# Dev Tools
brew "postgresql@16"
brew "terraform"
cask "bruno"
cask "dbeaver-community"
cask "ngrok"
cask "postman"
cask "visual-studio-code"
cask "zed"

# AI
cask "claude-code"
brew "gemini-cli"
brew "opencode"

# Xcode
brew "cocoapods"
brew "xcode-build-server"
brew "xcbeautify"
brew "xcp"

# Docker
brew "colima"
brew "docker"
brew "docker-credential-helper"

# Rails
brew "libpq"
brew "libyaml"

# AWS
brew "awscli"
brew "aws-sam-cli"
cask "session-manager-plugin"
brew "granted"
