########################### TAPS ###########################

tap "asmvik/formulae"
tap "felixkratz/formulae"
tap "anomalyco/tap"
tap "sadiksaifi/tap"

########################### FONTS ###########################

cask "font-fira-code-nerd-font"
cask "font-sf-pro"
cask "sf-symbols"

########################### TERMINAL ###########################

# Terminal App
cask "ghostty"
cask "wezterm@nightly"

# Terminal Workflow
brew "stow"
brew "trash-cli"

# CLI
brew "mise"

########################### DESKTOP ###########################

# Desktop Workflow
brew "local/yabai/yabai"
brew "skhd"
brew "borders"
brew "sketchybar"

# Desktop App
cask "ente-auth"
cask "firefox"
cask "iina"
cask "localsend"
cask "slack"
cask "tailscale-app"
cask "zoom"

########################### DEVELOPMENT ###########################

# Dev Tools
brew "postgresql@16"
cask "bruno"
cask "dbeaver-community"
cask "ngrok"
cask "postman"
cask "visual-studio-code"
cask "zed"

# AI
cask "opencode-desktop"

# Xcode
brew "xcode-build-server"
brew "xcp"

# Docker
brew "docker-credential-helper"

# Rails
brew "libpq"
brew "libyaml"

# AWS
brew "granted"
cask "session-manager-plugin"

cask "modern-csv"
cask "brave-browser"
