brew "gemini-cli"
brew "docker"
brew "docker-credential-helper"
brew "colima"
brew "cocoapods"
brew "xcode-build-server"
brew "libpq"
brew "libyaml"
brew "postgresql@16"

cask "bruno"
cask "dbeaver-community"
cask "ente-auth"
cask "firefox"
cask "flashspace"
cask "ghostty"
cask "iina"
cask "localsend"
cask "postman"
cask "slack"
cask "visual-studio-code"
cask "wezterm@nightly"
cask "zed"
cask "zoom"
cask "claude-code"

tap "sst/tap"
brew "opencode"
